.doom.d/literate_config.org
#+TITLE: Doom Emacs Literate Configuration
#+DESCRIPTION: I though this might be easier to read and find things,
#+DESCRIPTION+: especially if I'm lazy and dont make seperate files in the future
#+STARTUP: content

* General Doom/Emacs Setup
** Personal Information
User information, used for git, email, templates, etc.
#+begin_src elisp
;; Some functionality uses this to identify you, e.g. GPG configuration, email
;; clients, file templates and snippets.
(setq user-full-name "Brandon Pollack"
      user-mail-address "brandonpollack23@gmail.com")
#+end_src

this file. Emacs searches the `load-path' when you load packages with
`require' or `use-package'.

** Global Options
#+begin_src elisp
(setq
 ;; Evil emacs mode cursor tells me it isn't evil
 evil-emacs-state-cursor '("purple" box)
 ;; Always confirm (even on splash and other not "real" buffers)
 confirm-kill-emacs 'y-or-n-p
 projectile-project-search-path '(
                                  ;; Local Source files
                                  "~/src/" "~/org/"
                                  ))
;; Start fullscreen
(add-to-list 'initial-frame-alist '(fullscreen . maximized))
;; Doom exposes five (optional) variables for controlling fonts in Doom. Here
;; are the three important ones:
;;
;; + `doom-font'
;; + `doom-variable-pitch-font'
;; + `doom-big-font' -- used for `doom-big-font-mode'; use this for
;;   presentations or streaming.
;;
;; They all accept either a font-spec, font string ("Input Mono-12"), or xlfd
;; font string. You generally only need these two:
;; (setq doom-font (font-spec :family "monospace" :size 12 :weight 'semi-light)
;;       doom-variable-pitch-font (font-spec :family "sans" :size 13))

;; There are two ways to load a theme. Both assume the theme is installed and
;; available. You can either set `doom-theme' or manually load a theme with the
;; `load-theme' function. This is the default:
(setq doom-theme 'doom-tomorrow-night)

;; make it so horizontal scroll is not a thing
(setq-default truncate-lines nil)
(setq-default word-wrap t)

;; Allow prompting for root whenever editing unpriveleged file
(auto-sudoedit-mode 1)
#+end_src

** Tramp Setup
*** Fancy Shell prompts with colors
+ Tramp hangs because when it tries to remote in, it attempts to detect a shell
  prompt. When there are fancy colors this is tough, so adding the .* regexp
  after the prompt chars fixes the issue.
#+begin_src elisp
(setq
 tramp-shell-prompt-pattern
 "\\(?:^\\|\\)[^]#$%>\n]*#?[]#$%>].* *\\(\\[[0-9;]*[a-zA-Z] *\\)*")
#+end_src

** Insertion methods :mozc:
+ Japanese input
+ 日本語！ テスト
+ Fix evil-org from doom overriding with electric indent, now mozc tries to
  handle the event first using the cmds! macro
#+begin_src elisp
(after! mozc
  (setq-default mozc-candidate-style 'echo-area))

(use-package! evil-org
  :when (featurep! :editor evil +everywhere)
  :config
  (map! :map evil-org-mode-map
        :i "RET" (cmds! mozc-mode (cmd! (mozc-handle-event last-command-event))
                        (cmd! (org-return electric-indent-mode)))
        :i [return] (cmds! mozc-mode (cmd! (mozc-handle-event last-command-event))
                           (cmd! (org-return electric-indent-mode)))))
#+end_src

** Line number styling
This determines the style of line numbers in effect. If set to `nil', line
numbers are disabled. For relative line numbers, set this to `relative'.

#+begin_src elisp
(setq display-line-numbers-type t)
#+end_src

** Window System
*** Popup window styling
Default is way too small, bigger is better
#+begin_src elisp
(set-popup-rules!
  '(("^\\*\\([Hh]elp\\|Apropos\\)"
     :slot 2 :vslot -8 :size 0.45 :select t)))
#+end_src
*** Break window out into workspace
#+begin_src elisp
(defun break-window-into-workspace ()
  "Takes current window and moves it to its own workspace/perspective"
  (interactive)
  (let ((buff (current-buffer)))
    (+workspace/close-window-or-workspace)
    (+workspace/new)
    (switch-to-buffer buff)
    (when (+popup-buffer-p)
      (+popup/raise (selected-window)))))
(map! :leader
      :prefix "TAB"
      :nv "b" 'break-window-into-workspace) ; b for break
#+end_src

** Spell Checking
I'm currently using spell-fu bundled with doom.
+ Set dictionary to english
+ Ignore certain faces.
#+begin_src elisp
(after! spell-fu
  (setq-default ispell-dictionary "en")
  (setq ispell-personal-dictionary "/home/brpol/.doom.d/etc/english.pws")
  (setf (alist-get 'markdown-mode +spell-excluded-faces-alist)
        '(markdown-code-face
          markdown-reference-face
          markdown-link-face
          markdown-url-face
          markdown-markup-face
          markdown-html-attr-value-face
          markdown-html-attr-name-face
          markdown-html-tag-name-face)))
#+end_src

** FUN STUFF!
*** Doom Dash
**** TODO if fancy splash displayed then emit Emacs in ascii
**** Code
This is mostly ripped from [[file:~/.emacs.d/modules/ui/doom-dashboard/config.el::defun doom-dashboard-draw-ascii-banner-fn (][Doom Dashboard]] itself.
#+begin_src elisp
(setq fancy-splash-image "~/.doom.d/logo.png")
(defun doom-dashboard-print-under-fancy-splash ()
  (when (display-graphic-p)
    (let* ((banner
            '(" _____                          "
              "| ____|_ __ ___   __ _  ___ ___ "
              "|  _| | '_ ` _ \\ / _` |/ __/ __|"
              "| |___| | | | | | (_| | (__\\__ \\"
              "|_____|_| |_| |_|\\__,_|\\___|___/"))
           (longest-line (apply #'max (mapcar #'length banner))))
      (put-text-property
       (point)
       (dolist (line banner (point))
         (insert (+doom-dashboard--center
                  +doom-dashboard--width
                  (concat
                   line (make-string (max 0 (- longest-line (length line)))
                                     32)))
                 "\n"))
       'face 'doom-dashboard-banner))))
(setq +doom-dashboard-functions
      '(doom-dashboard-widget-banner
        doom-dashboard-print-under-fancy-splash
        doom-dashboard-widget-shortmenu
        doom-dashboard-widget-loaded
        doom-dashboard-widget-footer))
#+end_src

* Custom helpful scripts
** Read file into a string
#+begin_src elisp
(defun get-string-from-file (filePath)
  "Return filePath's file content."
  (with-temp-buffer
    (insert-file-contents filePath)
    (buffer-string)))
#+end_src
** Turn into lower mini buffer (good for repls)
+ Bind mini replify to :leader M
#+begin_src elisp
(defun my-move-window-to-mini-repl ()
  "Move window to bottm and give it a height of 15px"
  (interactive)
  (+evil/window-move-down)
  (evil-window-set-height 15))
(map! :leader
      ;; m for mini
      :n "M" #'my-move-window-to-mini-repl)
#+end_src

* Custom (non mode specific) Bindings
Papa Henrik has a great [[https://github.com/hlissner/doom-emacs/blob/2d140a7a80996cd5d5abc084db995a8c4ab6d7f4/modules/config/default/%TBevil-bindings.el][DOOM Bindings Reference]]
** Global Bindings
Expand/contract visual mode selection
#+begin_src elisp
(map! :leader
      :prefix "v"
      :v "v" #'er/expand-region
      :v "SPC" #'er/contract-region)
#+end_src
** Lisp bindings
These help with navigation and movement in paren world
#+begin_src elisp
(map!
 :nvi "C-M-," 'sp-backward-slurp-sexp
 :nvi "C-M-." 'sp-forward-slurp-sexp
 :nvi "C-M-l" 'sp-forward-barf-sexp
 :nvi "C-M-h" 'sp-backward-barf-sexp
 :nvi "C-M-j" 'sp-beginning-of-next-sexp
 :nvi "C-M-k" 'sp-beginning-of-previous-sexp
 :nvi "C-M-u" 'backward-up-list
 :nvi "C-M-g" 'down-list)
#+end_src

* Modes/Packages
** Evil
*** Evil Easymotion
The default did not have enough avy-keys (jump keys, whatever)
#+begin_src elisp
(after! evil-easymotion
  ;; evil-easymotion (built on avy) jump keys
  (setq avy-keys '(?a ?s ?d ?f ?g ?h ?i ?k ?l ?\; ?t ?u ?v ?b ?n ?m ?i ?,))
  ;; evil-easymotion use first column
  (evilem-make-motion
   evilem-motion-next-line #'next-line
   :pre-hook (setq evil-this-type 'line)
   :bind ((temporary-goal-column 0)
          (line-move-visual nil)))
  (evilem-make-motion
   evilem-motion-previous-line #'previous-line
   :pre-hook (setq evil-this-type 'line)
   :bind ((temporary-goal-column 0)
          (line-move-visual nil))))
#+end_src

*** Evil Escape
Let me use jj to exit insert mode.
#+begin_src elisp
(use-package! evil-escape
  :init
  (setq evil-escape-delay 0.3)
  (setq evil-escape-key-sequence "jj"))
#+end_src

*** Ace Window
Make it so even rob can see window jumps
#+begin_src elisp
(custom-set-faces!
  '(aw-leading-char-face
    :foreground "white" :background "red"
    :weight bold :height 2.5 :box (:line-width 7 :color "red")))
#+end_src

*** Evil Matchit
Enable matching on stuff like html tags
#+begin_src elisp
(use-package! evil-matchit)
(global-evil-matchit-mode 1)
#+end_src

** Org Mode
*** General
