.doom.d/literate_config.el

;; Utility since %s is ignored in todo prefix format.
(defun myorg-get-scheduled-date-for-todo ()
  (let ((scheduled (org-get-scheduled-time (point))))
    (if scheduled
        (format-time-string "%Y-%m-%d %I:%M %p => " scheduled)
      "")))

(after! org
  ;; If you use `org' and don't want your org files in the default location below,
  ;; change `org-directory'. It must be set before org loads!
  (setq org-directory "~/org/"
        org-agenda-files `(,org-directory ,(concat org-directory "gmail_calendars"))
        org-todo-keywords '((sequence "TODO(t)" "INPROGRESS(i)" "WAITING(w)" "|" "DONE(d)" "CANCELLED(c)")
                            (sequence "[ ](T)" "[-](S)" "[?](W)" "|" "[X](D)")
                            (sequence "|" "OKAY(o)" "YES(y)" "NO(n)"))
        org-todo-keyword-faces '(("TODO" :foreground "forestgreen" :weight bold :underline t)
                                 ("INPROGRESS" :foreground "darkorange" :weight bold :underline t)
                                 ("WAITING" :foreground "yellow" :weight normal :underline nil)
                                 ("CANCELLED" :foreground "red" :weight bold :underline t))
        org-log-done 'time


        org-refile-targets '((nil :maxlevel . 4)
                             (org-agenda-files :maxlevel . 4))
        ;; Show that whitespace
        org-cycle-separator-lines -1
        ;; Show only top level TODO items.
        org-agenda-todo-list-sublevels nil
        ;; Modified from default to show schedules in TODO items
        org-agenda-prefix-format '((agenda . " %i %-12:c%?-12t% s")
                                   (todo . " %i %-12:c%(myorg-get-scheduled-date-for-todo)")
                                   (tags . " %i %-12:c")
                                   (search . " %i %-12:c"))
        ;; Checklist cookies take into account full heirarchy.
        org-checkbox-hierarchical-statistics nil))

(after! org-capture
  :config
  ;; Quick captures
  (setq org-capture-templates '(("x" "Inbox" entry
                                 (file+headline "~/org/inbox.org" "Tasks To Sort")
                                 "* %i%?")
                                ("t" "TODO Item" entry
                                 (file+headline "~/org/todo.org" "To Do List")
                                 "* TODO %i%?")
                                ("r" "Add (R)eminder" entry
                                 (file+headline "~/org/reminders.org" "Reminders")
                                 "* TODO %?\nSCHEDULED: %(org-insert-time-stamp (org-read-date t t nil \"When would you like to be reminded?\") t)"))))

(after! (:and evil-smartparens org-mode)
  :init
  (add-hook 'org-mode-hook #'turn-off-smartparens-mode))

(after! org-id
  ;; This function allows id link completion
  (defun org-id-complete-link (&optional arg)
    "Create an id: link using completion using ARG."
    (concat "id:" (org-id-get-with-outline-path-completion)))
  (org-link-set-parameters "id" :complete #'org-id-complete-link))

(use-package! org-depend :after org)

(defun myorg-archive-done-tasks ()
  (interactive)
  (org-map-entries 'org-archive-subtree "/DONE" 'tree))
(map! :localleader
      :n "m" #'myorg-archive-done-tasks)

;; TODO this doesnt work yet.
;; TODO when it does at it to save hook for org files with a check if it within org directory.
(defun myorg-get-title (dirfile-buffer)
  "org helper to extract the #+TITLE string"
  "DUMMY TITLE"
  )

(defun myorg-get-description (dirfile-buffer)
  "org helper to extract the #+DESCRIPTION string"
  "DUMMY DESCRIPTION"
  )

(defun myorg-export-files-insert-heading (buffer dirfile)
  "Inserts a single file with sub headings based on path in org directory"
  (let* ((index-buffer (current-buffer))
         (path-list (split-string dirfile "/")))
    (while (not (null path-list))
      (if (= (length path-list) 1)
          ;; This is the file itself
          (let*
              ((dirfile-buffer (find-file-read-only dirfile))
               ;; TODO extract the TITLE and DESCRIPTION functions (maybe org-capture/org-collect-keywords)
               (title (myorg-get-title dirfile-buffer))
               (description (myorg-get-description dirfile-buffer)))
            (progn
              (set-buffer index-buffer)
              (org-insert-heading)
              (insert title "\n" description)
              (pop path-list)))
        (progn
          (org-insert-heading)
          (org-metaright)
          (insert (pop path-list) "\n")))
      )))

(defun myorg-export-files-insert-headings (buffer) "Inserts all files by directory into subheadings into an index file"
       (dolist (dirfile (directory-files-recursively org-directory))
         myorg-export-files-insert-heading buffer dirfile))


(defun myorg-export-files-as-index ()
  "Export all the files in org as top level linked headings with the
descriptions as subtext into an org file with directories indicating subheadings"
  (interactive)
  (with-temp-buffer
    (insert "#+TITLE: Index" ?\n
            "#+DESCRIPTION: This is an autogenerated "
            "index of all the org files in the org-directory" ?\n ?\n)
    (myorg-export-files-insert-headings (current-buffer))
    ;; TODO save buffer to org-directory/index.org
    (message (buffer-string))))

(use-package! org-wild-notifier
  :config
  (setq org-wild-notifier-alert-time 10
        org-wild-notifier-alert-times-property "WILD_NOTIFIER_NOTIFY_BEFORE: 5"
        org-wild-notifier-notification-title "Reminder Notification!"
        org-wild-notifier-keyword-whitelist '("TODO")
        org-wild-notifier-tags-blacklist nil
        org-wild-notifier-tags-whitelist nil
        org-wild-notifier-keyword-whitelist nil)
  (org-wild-notifier-mode))

(after! alert
  (setq alert-default-style 'libnotify))

(use-package! org-gcal
  :config
  (defvar gmail_dir (concat org-directory "gmail_calendars/"))
  (setq
   org-gcal-client-id "936800008942-so0ctu4f2029386ujcfcp9ke3af91la2.apps.googleusercontent.com"
   org-gcal-client-secret (if (file-exists-p (concat gmail_dir "gcal_client_secret"))
                              (s-trim (get-string-from-file (concat gmail_dir "gcal_client_secret"))) "")
   org-gcal-fetch-file-alist `(("brandonpollack23@gmail.com" . ,(concat gmail_dir "personal.org"))
                               ("dnu3qs4g5pp6h4m9rfhsppgbik@group.calendar.google.com" . ,(concat gmail_dir "study.org")))
   org-gcal-down-days 365
   org-gcal-recurring-events-mode 'nested))

(use-package calfw-org
  :init
  (defun my-open-calendar ()
    (interactive)
    (cfw:open-calendar-buffer
     :contents-sources
     (list
      (cfw:org-create-source "Green")  ; org-agenda source
      ;; (cfw:org-create-file-source "Gmail Personal Calendar" (concat gmail_dir "personal.org") "Green")  ; other org source
      ;; (cfw:howm-create-source "Blue")  ; howm source
      ;; (cfw:cal-create-source "Orange") ; diary source
      ;; (cfw:ical-create-source "Moon" "~/moon.ics" "Gray")  ; ICS source1
      ;; (cfw:ical-create-source "gcal" "https://..../basic.ics" "IndianRed") ; google calendar ICS
      )))
  :config
  (map! :leader
        :prefix "o"
        :n "c" #'my-open-calendar))
