.doom.d/literate_config.org
*** Org Super Agenda
#+begin_src elisp
;; Before date is 5 days from now (so within a work week)
(use-package! org-super-agenda
  :after org-agenda
  :config
  (org-super-agenda-mode)
  (let ((before-date (format-time-string "%F" (+ (* 60 60 24 5) (float-time)))))
    (setq org-super-agenda-groups `((:name "RIGHT NOW TODO List"
                                     :and (:priority "A"))

                                    (:name "TODO List"
                                     :file-path "org/todo.org")

                                    (:name "Upcoming Deadline Reminders In the next 5 days"
                                     :and (:deadline (before ,before-date)
                                           :file-path "org/reminders.org"))

                                    (:name "Upcoming Scheduled Reminders In the next 5 days"
                                     :and (:scheduled (before ,before-date)
                                           :file-path "org/reminders.org"))

                                    (:name "Technical Project Stuff"
                                     :and (:not (:priority "C")
                                           :file-path "org/technical_projects.org"))

                                    (:name "Deepspace9 Tasks"
                                     :file-path "org/deepspace9.org")

                                    (:name "Japan Move"
                                     :and (:file-path "org/moving_to_japan.org"
                                           :not (:todo "WAITING")))

                                    (:name "Backlog" :priority "C")

                                    (:name "Blocked Items"
                                     :todo "WAITING"))))
  org-super-agenda-header-separator (concat "\n" (make-string 80 ?=) "\n")
  ;; Workaround for keybinding problems
  org-super-agenda-header-map (make-sparse-keymap))
#+end_src
*** Org Journal SPC-n-j-j
+ Day actually ends at 3 AM
+ not 24 hour time
+ weekly journal files
+ better journal file names
#+begin_src elisp
(use-package! org-journal
  :config
  (setq
   org-extend-today-until 3
   org-journal-file-format "jnl_Week_Of_%F"
   org-journal-file-type 'weekly
   org-journal-time-format "%I:%M %p"))
#+end_src

** Email mu4e
Inspired by: [[https://groups.google.com/g/mu-discuss/c/BpGtwVHMd2E][This Google Groups Post]]
*** Tasks
**** TODO create more mu4e-bookmarks for my tags in gmail
*** Code
#+begin_src elisp
(unless (eq system-type 'windows-nt)
  (after! mu4e
    :config
    (setq +mu4e-backend 'offlineimap)
    (setq mu4e-get-mail-command "offlineimap -o -q")
    (setq mu4e-index-update-error-continue t)
    (setq mu4e-index-update-error-warning t)
    (setq mu4e-maildir "~/mail")
    (setq mu4e-update-interval (* 60 5))
    (set-email-account! "Gmail"
                        '((mu4e-sent-folder       . "/Gmail/All Mail")
                          (mu4e-drafts-folder     . "/Gmail/Drafts")
                          (mu4e-trash-folder      . "/Gmail/Trash")
                          (mu4e-refile-folder     . "/Gmail/All Mail")
                          (smtpmail-smtp-user     . "brandonpollack23@gmail.com")
                          (user-mail-address      . "brandonpollack23@gmail.com")
                          (mu4e-compose-signature
                           . "---\nBrandon Pollack\n ブランドンポラック"))
                        t)
    (setq mu4e-bookmarks `(("x:\\\\Inbox" "Inbox" ?i)
                           ("x:\\\\Inbox AND flag:unread" "Inbox Unread" ?n)
                           ("flag:flagged" "Flagged messages" ?f)
                           (,(concat "flag:unread AND "
                                     "NOT flag:trashed AND "
                                     "NOT maildir:/[Gmail].Spam AND "
                                     "NOT maildir:/[Gmail].Bin")
                            "Unread messages" ?u)))
    (add-hook 'mu4e-mark-execute-pre-hook
              (lambda (mark msg)
                (cond ((member mark '(refile trash))
                       (mu4e-action-retag-message msg "-\\Inbox"))
                      ((equal mark 'flag)
                       (mu4e-action-retag-message msg "\\Starred"))
                      ((equal mark 'unflag)
                       (mu4e-action-retag-message msg "-\\Starred")))))
    ))
#+end_src

** Aggressive Indent
For Pretty code
#+begin_src elisp
(use-package! aggressive-indent
  :config
  (global-aggressive-indent-mode 1)
  (setq aggressive-indent-comments-too 1))
#+end_src

** Info Mode
Better font bigger text, yo
#+begin_src elisp
(defun my-buffer-face-mode-variable ()
  "Set font to a variable width (proportional) fonts in current buffer"
  (interactive)
  (setq buffer-face-mode-face '(:family "DejaVuSans" :height 150 :width semi-condensed))
  (buffer-face-mode))
(add-hook 'Info-mode-hook 'my-buffer-face-mode-variable)
#+end_src

** Command Log Mode
This allows me to record a sequence of commands. Useful for debugging, seeing
what functions are bound to what keys I'm pressing, and showing others what I'm
doing.
#+begin_src elisp
(use-package! command-log-mode
  :config
  (map! :leader
        :prefix "v"
        :nv "l" 'clm/toggle-command-log-buffer)
  (setq command-log-mode-window-size 80)
  (setq command-log-mode-open-log-turns-on-mode t))
#+end_src

* Languages
** Emacs Refactor
Library that helps me out with extract function and the like, especially for
elisp (and where there's no LSP I guess)
#+begin_src elisp
(use-package! emr
  :config
  (map!
   :nvi "M-RET" #'emr-show-refactor-menu))
#+end_src
** Racket
#+begin_src elisp
(map! :after racket-mode
      :map racket-mode-map
      :localleader
      :n "n" #'racket-debug-step-over
      :n "N" #'racket-debug-step)
#+end_src
** Clojure
Enable Fuzzy candidate matching in Cider
#+begin_src elisp
(use-package! cider-mode
  :hook ((cider-mode . cider-company-enable-fuzzy-completion)))
(use-package! cider-repl-mode
  :hook ((cider-mode . cider-company-enable-fuzzy-completion)))
#+end_src

* Platform Specific
** WSL
+ Web browser opening doesn't work without this
+ Add custom alerting that requires BurntToast on windows
#+begin_src elisp
;; Determine the specific system type.
;; Emacs variable system-type doesn't yet have a "wsl/linux" value,
;; so I'm front-ending system-type with my variable: sysTypeSpecific.
;; I'm no elisp hacker, so I'm diverging from the elisp naming convention
;; to ensure that I'm not stepping on any pre-existing variable.
(setq sysTypeSpecific  system-type) ;; get the system-type value

(cond
 ;; If type is "gnu/linux", override to "wsl/linux" if it's WSL.
 ((eq sysTypeSpecific 'gnu/linux)
  (when (string-match "Linux.*Microsoft.*Linux"
                      (shell-command-to-string "uname -a"))

    (setq sysTypeSpecific "wsl/linux") ;; for later use.
    (setq
     cmdExeBin "/mnt/c/Windows/System32/cmd.exe"
     cmdExeArgs '("/c" "start"))
    (setq
     browse-url-generic-program  cmdExeBin
     browse-url-generic-args     cmdExeArgs
     browse-url-browser-function 'browse-url-generic)

    ;; Create custom alert style that uses BurntToast
    (alert-define-style 'burnttoastwsl :title "WSL Burnt Toast"
                        :notifier
                        (lambda (info)
                          (let
                              ;; The message text is :message
                              ((msg (plist-get info :message))
                               ;; The :title of the alert
                               (title (plist-get info :title))
                               ;; The :category of the alert
                               (cat (plist-get info :category)))
                            (message (concat "ALERT!!!!\n\t" title "\n\t" cat "\n\t" msg))
                            (shell-command
                             (concat "powershell.exe \"New-BurntToastNotification -Text \\\"" title "\n" cat "\n" msg "\\\"\"")))))
    (after! alert
      (setq alert-default-style 'burnttoastwsl)))))
#+end_src

* Local machine only config
This here detects a local only ".emacs.local" file and runs that as well. This
is useful for environment specific setup like @ work with custom packages.
#+begin_src elisp
(if (file-exists-p "~/.emacs.local")
    (load-file "~/.emacs.local"))
#+end_src
